/**                             
  ******************************************************************************
  **--------------------------------------------------------------------------**
  ** @FileName      : main.c  
  ** @Brief         : 增加复位/置位函数
  **--------------------------------------------------------------------------**
  ** @Author Data   : Eric 2023-12-29
  ** @Version       : v1.0				
  **--------------------------------------------------------------------------**
  ** @Function List : None
  **--------------------------------------------------------------------------**
  ** @Attention     : Complier(V.6.19)
  **--------------------------------------------------------------------------**
  ******************************************************************************
  *
 **/
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"


int main(void)
{
  RCC->APB2ENR |= ((1) << 3); // 开启GPIOB的时钟
  GPIOB->CRL &= ~((0x0F) << (4*1)); // 将GPIOB状态复位
  GPIOB->CRL |= ((1) << (4*1)); // 将GPIOB设置为推挽输出

  /*----------------------------------------------------------------
  说明：
  由于我的开发板，PB0总是点亮蓝灯(本应该是绿灯), 以后的测试换为测试蓝灯，PB1口
  *---------------------------------------------------------------*/
  GPIO_SetBits(GPIOB, GPIO_Pin_0); // PB0置1 绿灯灭
  GPIO_SetBits(GPIOB, GPIO_Pin_1); // PB1置1 蓝灯灭
  GPIO_SetBits(GPIOB, GPIO_Pin_5); // PB5置1 红灯灭
  GPIO_ResetBits(GPIOB, GPIO_Pin_1); // PB1置0 蓝灯亮
}

// Arm6 编译器不需要下面的操作
void SystemInit(void)
{
    // 函数体为空，目的是骗过编译器不报错
}
